Repository: tpay-com/tpay-prestashop
Catalog: translations/*/ModulesTpayAdmin.*.xlf
Languages: pl_pl

source: Fee charged for this payment method:
pl_pl: Opłata za płatność online:

source: you will use sandbox mode - it is a different environment with mocked payment gateways - don't use it in production!
pl_pl: będziesz używał środowiska sandbox - jest to środowisko z zaślepionymi bramkami płatności - nie używaj tego na produkcji!

source: Accepting online payments
pl_pl: Przyjmowanie płatności online

source: Auto cancel active
pl_pl: Automatyczne anulowanie aktywne

source: Auto cancel orders and transactions settings
pl_pl: Ustawienia automatycznego anulowania zamówień i transakcji

source: Auto cancel should be in range 1 - 30
pl_pl: Zakres dni określających anulowanie transakcji powinien być w zakresie 1 - 30

source: BLIK Pay Later
pl_pl: BLIK Płacę Później

source: BLIK Pay Later is a deferred payment service for transactions ranging from 30 PLN to 4,000 PLN. You will receive the money for the sold goods immediately, while the Customer will have 30 days to make the payment.
pl_pl: BLIK Płacę Później to usługa płatności odroczonych dla transakcji od 30 zł do 4 000 zł. Pieniądze za sprzedany towar dostaniesz od razu, a Klient będzie miał 30 dni na płatność.

source: BLIK payments active
pl_pl: Płatności BLIK aktywne

source: BLIK widget
pl_pl: Widget BLIK

source: Basic settings
pl_pl: Ustawienia podstawowe

source: CRC field form
pl_pl: Forma pola CRC

source: Calculate installment!
pl_pl: Oblicz ratę!

source: Can't enable BLIK Pay Later?
pl_pl: Nie możesz włączyć BLIK Płacę Póżniej?

source: Cancel orders and transactions after days
pl_pl: Anuluj zamówienie i transakcję po upływie wskazanej liczby dni

source: Card widget
pl_pl: Widget kart

source: Context installation error
pl_pl: Błąd instalacji kontekstu

source: Credentials are correct.
pl_pl: Dane uwierzytelniające są poprawne.

source: Credentials are incorrect!
pl_pl: Dane uwierzytelniające są błędne!

source: Credit card settings
pl_pl: Ustawienia bramki kartowej

source: Custom order
pl_pl: Własna kolejność

source: Custom order of displayed banks. Drag to change order. The ability to change the order of payment methods is possible when the "Direct bank redirect" option is enabled.
pl_pl: Własna kolejność wyświetlanych banków. Przeciągnij, żeby zmienić kolejność. Możliwość zmiany kolejności metod płatności jest możliwa przy uruchomionej opcji "Bezpośrednie przekierowanie do banku".

source: Custom order of displayed payment methods. Drag to change order
pl_pl: Własna kolejność wyświetlanych metod płatności. Przeciągnij, żeby zmienić kolejność

source: Delete this module?
pl_pl: Usunąć moduł?

source: Display the payment method in the widget. If you have other plugins that modify the shopping cart configuration, you should disable this option.
pl_pl: Wyświetl metodę płatności w widgecie. W przypadku posiadania innych wtyczek, które modyfikują konfigurację koszyka zakupowego, należy wyłączyć tę opcję.

source: Error adding order statuses
pl_pl: Błąd podczas dodawania statusów zamówienia

source: Find in Merchant’s panel: Credit cards payment -> API
pl_pl: Znajdziesz w Panelu Akceptanta: Płatności kartami -> API

source: Find in Merchant’s panel: Integration -> API -> Open API Keys
pl_pl: Znajdziesz w Panelu Akceptanta: Integracje -> API -> Klucze do nowego Open API

source: Find in Merchant’s panel: Settings -> Notifications
pl_pl: Znajdziesz w Panelu Akceptanta: Ustawienia -> Powiadomienia

source: Generic payments
pl_pl: Płatności generyczne

source: Installation error
pl_pl: Błąd instalacji

source: Installment simulator active
pl_pl: Symulator rat aktywny

source: Invalid RSA key
pl_pl: Niepoprawny klucz RSA

source: Invalid email notification
pl_pl: Niepoprawny e-mail notyfikacji

source: Learn more
pl_pl: Dowiedz się więcej

source: Log in to
pl_pl: Zaloguj się do

source: May cause some performance issues. Use this method if you cannot set cronjob to run CLI task once a day: `php modules/tpay/cron.php`
pl_pl: Może powodować spadki wydajności. Używaj tej metody wyłącznie, gdy nie jesteś w stanie skonfigurować zadania harmonogramu (cron), aby uruchamiał raz dziennie konsolowe polecenie: `php modules/tpay/cron.php`

source: Merchant ID
pl_pl: ID merchanta

source: Merchant secret key (in notifications)
pl_pl: Kod bezpieczeństwa (w powiadomieniach)

source: No
pl_pl: Nie

source: Notification email
pl_pl: Email powiadomień

source: Online payment fee
pl_pl: Opłata za płatność online

source: Payment credit card
pl_pl: Płatność kartą

source: Payment error status
pl_pl: Status transakcji zakończonej błędem

source: Pekao installments simulator settings
pl_pl: Ustawienia symulatora rat Pekao

source: Percentage
pl_pl: Procent

source: Please complete the secret key
pl_pl: Proszę uzupełnić Secret

source: Please complete the secret merchant key
pl_pl: Proszę uzupełnić kod bezpieczeństwa

source: Please fill in the client id
pl_pl: Proszę uzupełnić Client ID

source: Process refund
pl_pl: Wykonaj zwrot

source: Quota
pl_pl: Kwota

source: RSA key
pl_pl: Klucz RSA

source: Redirect directly to bank
pl_pl: Bezpośrednie przekierowanie do banku

source: Refund amount
pl_pl: Kwota zwrotu

source: Refund date
pl_pl: Data zwrotu

source: Refund error. Check that the refund amount is correct and does not exceed the value of the order
pl_pl: Błąd podczas wykonywania zwrotu. Sprawdź czy wartość zwrotu nie przekracza wartości zamówienia.

source: Refund error. Amount Value is outside of declared precision
pl_pl: Błąd podczas wykonywania zwrotu. Wartość kwoty jest poza zadeklarowaną precyzją.

source: Refund error. Provided transaction id does not exist, is not available or the transaction has been paid
pl_pl: Błąd podczas wykonywania zwrotu. Podany identyfikator transakcji nie istnieje, jest niedostępny lub transakcja została opłacona.

source: Refund error. Refund period for this transaction has expired
pl_pl: Błąd podczas wykonywania zwrotu. Okres zwrotu dla tej transakcji wygasł.

source: Refund error. You can not make a refund for a transaction that has already had a refund request within the last 60 seconds
pl_pl: Błąd podczas wykonywania zwrotu. Kolejna prośba o zwrot dla tej transakcji może zostać złożona najwcześniej za 60 sekund.

source: Refund error. You cannot refund collect transaction
pl_pl: Błąd podczas wykonywania zwrotu. Nie można zwrócić transakcji Collect.

source: Refund error. You cannot refund marketplace transaction
pl_pl: Błąd podczas wykonywania zwrotu. Nie można dokonać zwrotu transakcji marketplace.

source: Refund error. You cannot refund transaction with status refunded
pl_pl: Błąd podczas wykonywania zwrotu. Transakcja została już zwrócona.

source: Refund successful. Return option is being processed please wait.
pl_pl: Zwrot wykonany pomyślnie. Proces zwrotu jest w trakcie przetwarzania, proszę czekać.

source: Refunded transaction title
pl_pl: Transakcja, której dotyczy zwrot

source: Reset module error
pl_pl: Błąd resetowania modułu

source: Save
pl_pl: Zapisz

source: Select payments to Easy on-site mechanism
pl_pl: Wybierz płatności do mechanizmu Easy on-site

source: Set your own email with notifications. Leave blank to use the email configured in the tpay panel.
pl_pl: Ustaw własny adres powiadomień. Pozostaw puste, aby używać ustawień z panelu akceptanta Tpay.

source: Settings for standard payment
pl_pl: Ustawienia do płatności standardowych

source: Settings not saved
pl_pl: Ustawienia nie zostały zapisane

source: Settings saved
pl_pl: Ustawienia zapisane

source: Show the method as a separate payment
pl_pl: Pokaż metodę jako osobną płatność

source: Status of a paid transaction with virtual products only
pl_pl: Status opłaconej transakcji, wyłącznie z produktami wirtualnymi

source: Status of paid transaction
pl_pl: Status transakcji opłaconej

source: Status of the transaction in process
pl_pl: Status transakcji oczekującej na płatność

source: Surcharge for the use of payment
pl_pl: Dopłata do obsługi płatności

source: Surcharge type
pl_pl: Typ dopłaty

source: Surcharge value
pl_pl: Stała wartość

source: Table installation error
pl_pl: Błąd instalacji tabeli

source: The installment simulator is available in the checkout
pl_pl: Symulator rat jest dostępny na stronie zamówienia

source: The installment simulator is available in the shopping cart
pl_pl: Symulator rat jest dostępny w koszyku zakupowym

source: The installment simulator is available on the product page
pl_pl: Symulator rat jest dostępny na karcie produktu

source: Tpay Merchant Panel
pl_pl: Panelu Akceptanta Tpay

source: Tpay refunds
pl_pl: Zwroty Tpay

source: Transaction statuses
pl_pl: Statusy transakcji

source: Transfer widget
pl_pl: Widget przelewów

source: Unable to process refund - amount is greater than allowed %s
pl_pl: Nie można przetworzyć zwrotu - kwota jest większa niż dozwolone %s

source: Unable to process refund - invalid amount
pl_pl: Nie można przetworzyć zwrotu - nieprawidłowa kwota

source: Use Sandbox Account
pl_pl: Używaj konta Sandbox

source: Use frontend to run CRON jobs
pl_pl: Wykorzystaj front sklepu do uruchamiania zadań harmonogramu

source: Use global settings
pl_pl: Używaj ustawień globalnych

source: WARNING
pl_pl: UWAGA

source: What is BLIK Pay Later?
pl_pl: Co to jest BLIK Płacę Później?

source: When the installment simulator is enabled, the merchant ID field must be filled in
pl_pl: Przy włączonym symulatorze rat, należy uzupełnić pole ID merchanta

source: Yes
pl_pl: Tak

source: Your address for notifications
pl_pl: Adres do notyfikacji

source: amount is greater than allowed %s
pl_pl: kwota jest większa niż dopuszczalna %s

source: and check if BLIK Pay Later is active. If the payment option is not enabled, activate it and then re-enable it in your store.
pl_pl: i sprawdź, czy masz aktywną płatność BLIK Płacę Później. Jeśli płatność nie jest włączona, aktywuj ją, a następnie uruchom ją ponownie w swoim sklepie.

source: invalid amount
pl_pl: nieprawidłowa kwota
