Repository: tpay-com/tpay-prestashop
Catalog: translations/*/ModulesTpayShop.*.xlf
Languages: pl_pl

source: Product
pl_pl: Produkt

source: Quantity
pl_pl: Ilość

source: Total price
pl_pl: Cena łączna

source: Unit price
pl_pl: Cena jednostkowa

source: (total)
pl_pl: (łącznie)

source: Accept blik code on mobile app
pl_pl: Zaakceptuj kod blik w aplikacji mobilnej banku

source: Add new card
pl_pl: Dodaj nową kartę

source: Address
pl_pl: Adres

source: An error occurred while ordering.
pl_pl: Podczas składania zamówienia wystąpił błąd.

source: BLIK POS is not available
pl_pl: BLIK niedostępny

source: BLIK insufficient funds / user authorization error
pl_pl: Niewystarczające środki lub anulowanie przez użytkownika

source: BLIK other error
pl_pl: Nieoczekiwany błąd BLIK

source: BLIK payment declined by user
pl_pl: płatność BLIK odrzucona przez użytkownika

source: BLIK payment error, try paying online.
pl_pl: Błąd płatności blik, spróbuj zapłacić online.

source: BLIK system general error
pl_pl: Błąd BLIK

source: BLIK user or system timeout
pl_pl: Przekroczono czas oczekiwania na BLIK

source: Browse list of your
pl_pl: Przeglądaj listę Twoich

source: Calculate installment!
pl_pl: Oblicz ratę!

source: Card number
pl_pl: Numer karty

source: Cart cannot be loaded or an order has already been placed using this cart
pl_pl: Nie można załadować koszyka lub zamówienie zostało już złożone przy użyciu tego koszyka

source: City
pl_pl: Miasto

source: Client identificator not provided.
pl_pl: Nie podano identyfikatora klienta.

source: Company
pl_pl: Firma

source: Confirm the payment in your bank's mobile app.
pl_pl: Potwierdź płatność w aplikacji mobilnej swojego banku.

source: Country
pl_pl: Kraj

source: Delete
pl_pl: Usuń

source: Delivery address:
pl_pl: Adres dostawy

source: Enter BLIK code
pl_pl: Wpisz kod BLIK

source: Enter a valid blik code
pl_pl: Podaj prawidłowy kod blik

source: Expiration date
pl_pl: Termin ważności

source: If your browser does not redirect you automatically press the button below.
pl_pl: Jeżeli Twoja przeglądarka nie przekieruje Cię automatycznie, kliknij przycisk poniżej.

source: Incorrect BLIK code
pl_pl: Niepoprawny kod BLIK

source: Incorrect card data
pl_pl: Nieprawidłowe dane karty

source: Incorrect transaction id
pl_pl: Niewłaściwe ID transakcji

source: Insufficient Funds
pl_pl: Niewystarczające środki

source: Invoicing address:
pl_pl: Adres rozliczeniowy

source: List of saved credit cards.
pl_pl: Lista zapisanych kart kredytowych.

source: My credit cards
pl_pl: Moje karty kredytowe

source: Name and surname
pl_pl: Imię i nazwisko

source: No active payment gateways
pl_pl: Brak aktywnych płatności

source: No stored credit cards
pl_pl: Brak zapisanych kart kredytowych

source: No support for cards
pl_pl: Brak wsparcia dla kart

source: Online payment
pl_pl: Płatność online

source: Online payment fee
pl_pl: Opłata za płatność online

source: Order history
pl_pl: Historia zamówień

source: Order price
pl_pl: Kwota zamówienia

source: Other payment methods
pl_pl: Inne metody płatności

source: Pay by online transfer with Tpay
pl_pl: Płać przelewem online za pomocą Tpay

source: Pay for your purchase with Tpay!
pl_pl: Zapłać za zakupy z Tpay!

source: Paying,
pl_pl: Płacąc,

source: Paying, you accept the
pl_pl: Płacąc, akceptujesz

source: Payment card
pl_pl: Płatność kartą

source: Payment completed successfully!
pl_pl: Płatność zakończona sukcesem!

source: Payment error
pl_pl: Błąd płatności

source: Payment error, please try again.
pl_pl: Błąd płatności, spróbuj ponownie.

source: Payment surcharge
pl_pl: Opłata za metodę płatności

source: Payment with Tpay
pl_pl: Płatność z Tpay

source: Phone
pl_pl: Telefon

source: Please accept the store rules
pl_pl: Proszę zaakceptować regulamin sklepu

source: Please choose payment method
pl_pl: Proszę wybrać metodę płatności

source: Please wait... In a moment you will be redirected to secure transaction panel.
pl_pl: Proszę czekać, za chwilę zostaniesz przekierowany do bezpiecznego panelu transakcyjnego.

source: Postal code
pl_pl: Kod pocztowy

source: Preload
pl_pl: Ładowanie

source: Processing data, please wait...
pl_pl: Przetwarzanie danych, proszę czekać...

source: Read the full content.
pl_pl: Czytaj więcej.

source: Retry payment
pl_pl: Ponów płatność

source: Save my card
pl_pl: Zapisz moją kartę

source: Shipping cost:
pl_pl: Koszt przesyłki

source: BLIK Pay Later
pl_pl: BLIK Płacę Później

source: BLIK Pay Later lets you defer payment for online purchases for 30 days, up to 4,000 PLN.
pl_pl: BLIK Płacę Później to usługa, która pozwala na odroczenie płatności za zakupy online do 30 dni, maksymalnie do 4000 PLN.

source: Summary of ordered products:
pl_pl: Podsumowanie zamówionych produktów

source: Thank you for using Tpay.
pl_pl: Dziękujemy za skorzystanie z usługi Tpay.

source: Thank you for your order and we invite you to further
pl_pl: Dziękujemy za złożenie zamówienia i zachęcamy do dalszych

source: The administrator of the personal data is Krajowy Integrator Płatności spółka akcyjna, based in Poznań.
pl_pl: Administratorem danych osobowych jest Krajowy Integrator Płatności spółka akcyjna z siedzibą w Poznaniu.

source: The blik code has expired
pl_pl: Kod blika stracił ważność

source: The code you entered is invalid or has expired.
pl_pl: Podany kod jest nieprawidłowy, bądź utracił ważność.

source: The security number located on the back of the payment card.
pl_pl: Numer zabezpieczający, znajdujący się na odwrocie karty płatniczej.

source: Tpay payment
pl_pl: Płatność Tpay

source: Transaction rejected by payer
pl_pl: Transakcja odrzucona przez płatnika

source: Transaction was not accepted in the bank's application
pl_pl: Transakcja nie została zaakceptowana w aplikacji banku

source: Use BLIK code
pl_pl: Płatność kodem BLIK

source: Use saved blik code
pl_pl: Płatność BLIK bez wpisywania kodu

source: What is BLIK Pay Later?
pl_pl: Co to jest BLIK Płacę Później?

source: Why don't I have to enter the code?
pl_pl: Dlaczego nie musisz wpisywać kodu?

source: You do not need to enter the BLIK code, because you linked your account to this device during one of the previous payments. The payment still requires confirmation in the app.
pl_pl: Nie musisz wpisywać kodu bo powiązałeś swoje konto z tym urządzeniem przy innej płatności. Płatność nadal wymaga potwierdzenia w aplikacji.

source: You will be redirected to the payment gateway.
pl_pl: Zostaniesz przekierowany do bramki płatności.

source: Your payment was not yet confirmed by Tpay. If you break payment, you can try to pay again.
pl_pl: Twoja płatność nie została jeszcze potwierdzona przez Tpay. Jeżeli wystąpił błąd podczas płatności, możesz ją ponowić.

source: Your shopping cart is empty.
pl_pl: Twój koszyk jest pusty

source: can not pay with BLIK code or alias for non BLIK transaction
pl_pl: nie możesz opłacić BLIKiem tej transakcji

source: error connecting BLIK system
pl_pl: błąd połączenia z systemem BLIK

source: given alias has not been registered or has been deregistered
pl_pl: ten alias nie został zarejestrowany lub został wyrejestrowany

source: given alias is non-unique
pl_pl: ten alias BLIK nie jest unikalny

source: given alias section is incorrect
pl_pl: ten alias jest niepoprawny

source: incorrect transaction status - should be pending
pl_pl: niewłaściwy status transakcji

source: invalid BLIK code or alias data format
pl_pl: błędny kod BLIK lub alias

source: invalid BLIK six-digit code
pl_pl: błędny kod BLIK

source: orders
pl_pl: zamówień

source: shopping
pl_pl: zakupów

source: terms and conditions.
pl_pl: regulamin.

source: tpay payment
pl_pl: Tpay

source: you accept the terms and conditions.
pl_pl: akceptujesz regulamin.
